import React from 'react';

const aubse = [
    "같은 새끼", "같은새끼", "개 새끼", "개같", "개나 소나", "개나대",
    "개나소나", "개넷", "개년", "개념빠가", "개독", "개돼지", "개련", "개련", "개마이", 
    "개부랄", "개삼성", "개새기", "개새끼", "개섹", "개셈", "개소리", "개쓰래기", "개저씨", 
    "거른다", "거지같은", "계새끼", "골 빈", "골1빈", "골빈", "공개 처형", "공개처형", "관.종", 
    "극1혐", "극혐", "김치녀", "꼬라지", "꼴갑", "꼴값", "꼴깝", "나쁜 새끼", "넌씨눈", "년놈", 
    "노무노무", "노알라", "늬믜", "늬미", "니년", "니믜", "니미럴", "닝기리", 
    "ㅁㅊ", "ㅁ친", "미1친", "미친 새", "미친~", "미친개", "미친새", "미친색", "병1신", "병1크", 
    "병맛", "병신", "병크", "봊", "븅신", "빠큐", "뻐큐", "뻑유", "뻑큐", "뻨큐", "뼈큐",
    "ㅄ", "ㅅ1ㅂ", "ㅅ1발", "ㅅㄲ네", "ㅅㄲ들", "ㅅㅌㅊ", "새1끼", "새1키", "새끼야", "샹년", "쉬발",
    "슈1발", "슈발", "슈벌", "슈우벌", "슈ㅣ발", "스벌", "싑창", 
    "시1발", "시바알", "시발", "시방새", "시벌탱", "시볼탱", "시부럴", "시빨", "시이발", 
    "시키가", "시팔", "시펄", "십창", "십팔", "ㅆ1ㄺ", "ㅆ1ㅂ", "ㅆㄹㄱ", "ㅆㄺ", "ㅆㅂ", 
    "싸물어", "쌉", "쌍년", "쌍놈", "쌔끼", "썅", "썌끼", "쒸펄", "쓰1레기", "쓰래기같", 
    "씨1발", "씨발", "씨방새", "씨벌", "씨벌탱", "씨볼탱", "씨부럴", 
    "씨부렬", "씨빨", "씨뻘", "씨이발", "씨팔", "씹덕", "씹못", 
    "씹새끼", "씹쌔", "씹창", "씹팔", "씹할", "아가리", "아닥", "애미", "앰창",
    "엠생", "엠창", "엿같", "이새끼", "ㅈㄴ", "ㅈㄹ", "젼나", "조낸", "조온나", "족까", "존 나", 
    "존1나", "존나", "존내", "졸라", "좁밥", "좆", "좆까", "좇같", "죠낸", "죠온나", 
    "죤나", "죤내", "죵나", "죶", "죽어버려", "쥐랄", "지 랄", "지1랄", "지랄", "쯰질", "찌1질", 
    "찌질한", "창년", "창녀", "창놈", "창넘", "처먹", "凸", "친놈", "ㅍㅌㅊ", "ㅎㅃ", 
    "ㅎㅌㅊ", "호로새끼", "호로잡", "후1빨", "후빨", "ㅗ"
]

const SearchFilter = () => {
    const test = aubse.matchAll('ㅗ');
    console.log(test);
    
    return test
}

export default SearchFilter;